In [34]:
pip install pandas

Requirement already satisfied: pandas in c:\users\yunus\appdata\local\programs\python\python311\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\yunus\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\yunus\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2022.7.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\yunus\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in c:\users\yunus\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
dictionary = {"name":["yunus","ali","ahmet","mehmet","engin","erkan"],
             "age":[24,25,27,28,29,None],
             "note":[128,526,778,754,None,809]}

datafram1 = pd.DataFrame(dictionary) 
print(dataframe1)

     name   age   note
0   yunus  24.0  128.0
1     ali  25.0  526.0
2   ahmet  27.0  778.0
3  mehmet  28.0  754.0
4   engin  29.0    NaN
5   erkan   NaN  809.0

In [4]:
head = datafram1.head() 
print(head)

     name   age   note
0   yunus  24.0  128.0
1     ali  25.0  526.0
2   ahmet  27.0  778.0
3  mehmet  28.0  754.0
4   engin  29.0    NaN

In [9]:
tail = datafram1.tail()
print(tail)
print(datafram1.columns)

     name   age   note
1     ali  25.0  526.0
2   ahmet  27.0  778.0
3  mehmet  28.0  754.0
4   engin  29.0    NaN
5   erkan   NaN  809.0
Index(['name', 'age', 'note'], dtype='object')

In [11]:
print(datafram1.info())
print("-----------------------------------")
print(datafram1.dtypes)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   note    5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 276.0+ bytes
None
-----------------------------------
name     object
age     float64
note    float64
dtype: object

In [13]:
print(datafram1.describe())

             age        note
count   5.000000    5.000000
mean   26.600000  599.000000
std     2.073644  286.066426
min    24.000000  128.000000
25%    25.000000  526.000000
50%    27.000000  754.000000
75%    28.000000  778.000000
max    29.000000  809.000000

In [15]:
print(datafram1["name"]) 
print("-----------------------------------")
print(datafram1.loc[:, "age"]) 
print("-----------------------------------")
datafram1["yeni_future"] = [1,2,3,4,5,6]
print(datafram1.loc[:3,"age"]) 
print("-----------------------------------")
print(datafram1.loc[:3, "name":"note"]) 
print("-----------------------------------")
print(datafram1.loc[::-1])

0     yunus
1       ali
2     ahmet
3    mehmet
4     engin
5     erkan
Name: name, dtype: object
-----------------------------------
0    24.0
1    25.0
2    27.0
3    28.0
4    29.0
5     NaN
Name: age, dtype: float64
-----------------------------------
0    24.0
1    25.0
2    27.0
3    28.0
Name: age, dtype: float64
-----------------------------------
     name   age   note
0   yunus  24.0  128.0
1     ali  25.0  526.0
2   ahmet  27.0  778.0
3  mehmet  28.0  754.0
-----------------------------------
     name   age   note  yeni_future
5   erkan   NaN  809.0            6
4   engin  29.0    NaN            5
3  mehmet  28.0  754.0            4
2   ahmet  27.0  778.0            3
1     ali  25.0  526.0            2
0   yunus  24.0  128.0            1

In [16]:
print(datafram1.yeni_future)

0    1
1    2
2    3
3    4
4    5
5    6
Name: yeni_future, dtype: int64

In [22]:
print(datafram1.loc[:, "age"])
print("-----------------------------------")
print(datafram1.loc[:3,"age"])
print("-----------------------------------")
print(datafram1.loc[:3, "name":"note"])
print("-----------------------------------")
print(datafram1.loc[:3, ["name","note"]])
print("-----------------------------------")
print(datafram1.loc[::-1])
print("-----------------------------------")
print(datafram1.loc[:,:"age"])
print("-----------------------------------")
print(datafram1.iloc[:,[2]])

0    24.0
1    25.0
2    27.0
3    28.0
4    29.0
5     NaN
Name: age, dtype: float64
-----------------------------------
0    24.0
1    25.0
2    27.0
3    28.0
Name: age, dtype: float64
-----------------------------------
     name   age   note
0   yunus  24.0  128.0
1     ali  25.0  526.0
2   ahmet  27.0  778.0
3  mehmet  28.0  754.0
-----------------------------------
     name   note
0   yunus  128.0
1     ali  526.0
2   ahmet  778.0
3  mehmet  754.0
-----------------------------------
     name   age   note  yeni_future
5   erkan   NaN  809.0            6
4   engin  29.0    NaN            5
3  mehmet  28.0  754.0            4
2   ahmet  27.0  778.0            3
1     ali  25.0  526.0            2
0   yunus  24.0  128.0            1
-----------------------------------
     name   age
0   yunus  24.0
1     ali  25.0
2   ahmet  27.0
3  mehmet  28.0
4   engin  29.0
5   erkan   NaN
-----------------------------------
    note
0  128.0
1  526.0
2  778.0
3  754.0
4    NaN
5  809.0

In [30]:
filter1 = datafram1.age>10                
datafram1["true/false"]= filter1
print(datafram1.loc[:,["age","true/false"]])

    age  true/false
0  24.0        True
1  25.0        True
2  27.0        True
3  28.0        True
4  29.0        True
5   NaN       False

In [26]:
type(filter1)

pandas.core.series.Series

In [27]:
filter_data= datafram1[filter1] 
print(filter_data)

     name   age   note  yeni_future   bol  true/false
0   yunus  24.0  128.0            1  True        True
1     ali  25.0  526.0            2  True        True
2   ahmet  27.0  778.0            3  True        True
3  mehmet  28.0  754.0            4  True        True
4   engin  29.0    NaN            5  True        True

In [28]:
filter2 = datafram1.note>100
filter_data2 = datafram1[filter2&filter1] 
print(filter_data2)

     name   age   note  yeni_future   bol  true/false
0   yunus  24.0  128.0            1  True        True
1     ali  25.0  526.0            2  True        True
2   ahmet  27.0  778.0            3  True        True
3  mehmet  28.0  754.0            4  True        True

In [31]:
datafram1[datafram1.age>20]

     name   age   note  yeni_future   bol  true/false
0   yunus  24.0  128.0            1  True        True
1     ali  25.0  526.0            2  True        True
2   ahmet  27.0  778.0            3  True        True
3  mehmet  28.0  754.0            4  True        True
4   engin  29.0    NaN            5  True        True

In [35]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\yunus\appdata\local\programs\python\python311\lib\site-packages (1.24.2)

In [36]:
import numpy as np
ort = datafram1.note.mean()
print(ort)
ort_np= np.mean(datafram1.note)
print(ort_np)

599.0
599.0

In [37]:
datafram1.dropna(inplace=True)
datafram1

     name   age   note  yeni_future   bol  true/false
0   yunus  24.0  128.0            1  True        True
1     ali  25.0  526.0            2  True        True
2   ahmet  27.0  778.0            3  True        True
3  mehmet  28.0  754.0            4  True        True

In [38]:
print(datafram1.note.mean())
datafram1["ortalama"]= ["ortalamanın altında" if datafram1.note.mean()>each else "ortalamanın üstünde" for each in datafram1.note]
datafram1

546.5

     name   age   note  yeni_future   bol  true/false             ortalama
0   yunus  24.0  128.0            1  True        True  ortalamanın altında
1     ali  25.0  526.0            2  True        True  ortalamanın altında
2   ahmet  27.0  778.0            3  True        True  ortalamanın üstünde
3  mehmet  28.0  754.0            4  True        True  ortalamanın üstünde

In [39]:
datafram1.columns = [each.upper() for each in datafram1.columns]
datafram1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENI_FUTURE', 'BOL', 'TRUE/FALSE', 'ORTALAMA'], dtype='object')

In [41]:
datafram1.columns = [ each.split(" ")[0]+"_"+each.split(" ")[1] if len(each.split(" "))>1 else each for each in datafram1.columns]
datafram1

     NAME   AGE   NOTE  YENI_FUTURE   BOL  TRUE/FALSE             ORTALAMA
0   yunus  24.0  128.0            1  True        True  ortalamanın altında
1     ali  25.0  526.0            2  True        True  ortalamanın altında
2   ahmet  27.0  778.0            3  True        True  ortalamanın üstünde
3  mehmet  28.0  754.0            4  True        True  ortalamanın üstünde

In [43]:
data1 = datafram1.head()     
data2 = datafram1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

     NAME   AGE   NOTE  YENI_FUTURE   BOL  TRUE/FALSE             ORTALAMA
0   yunus  24.0  128.0            1  True        True  ortalamanın altında
1     ali  25.0  526.0            2  True        True  ortalamanın altında
2   ahmet  27.0  778.0            3  True        True  ortalamanın üstünde
3  mehmet  28.0  754.0            4  True        True  ortalamanın üstünde
0   yunus  24.0  128.0            1  True        True  ortalamanın altında
1     ali  25.0  526.0            2  True        True  ortalamanın altında
2   ahmet  27.0  778.0            3  True        True  ortalamanın üstünde
3  mehmet  28.0  754.0            4  True        True  ortalamanın üstünde

In [44]:
data_contact2 = pd.concat([data1,data2],axis=1)
data_contact2

,NAME,AGE,NOTE,YENI_FUTURE,BOL,TRUE/FALSE,ORTALAMA,NAME,AGE,NOTE,YENI_FUTURE,BOL,TRUE/FALSE,ORTALAMA
0,yunus,24.0,128.0,1,True,True,ortalamanın altında,yunus,24.0,128.0,1,True,True,ortalamanın altında
1,ali,25.0,526.0,2,True,True,ortalamanın altında,ali,25.0,526.0,2,True,True,ortalamanın altında
2,ahmet,27.0,778.0,3,True,True,ortalamanın üstünde,ahmet,27.0,778.0,3,True,True,ortalamanın üstünde
3,mehmet,28.0,754.0,4,True,True,ortalamanın üstünde,mehmet,28.0,754.0,4,True,True,ortalamanın üstünde

In [45]:
datafram1["buyuk_yas"] = [each*2 for each in datafram1.AGE]
datafram1

,NAME,AGE,NOTE,YENI_FUTURE,BOL,TRUE/FALSE,ORTALAMA,buyuk_yas
0,yunus,24.0,128.0,1,True,True,ortalamanın altında,48.0
1,ali,25.0,526.0,2,True,True,ortalamanın altında,50.0
2,ahmet,27.0,778.0,3,True,True,ortalamanın üstünde,54.0
3,mehmet,28.0,754.0,4,True,True,ortalamanın üstünde,56.0

In [46]:
def mlt(yas):
    return yas*2
datafram1["apply_metodu"] = datafram1.AGE.apply(mlt)
datafram1

,NAME,AGE,NOTE,YENI_FUTURE,BOL,TRUE/FALSE,ORTALAMA,buyuk_yas,apply_metodu
0,yunus,24.0,128.0,1,True,True,ortalamanın altında,48.0,48.0
1,ali,25.0,526.0,2,True,True,ortalamanın altında,50.0,50.0
2,ahmet,27.0,778.0,3,True,True,ortalamanın üstünde,54.0,54.0
3,mehmet,28.0,754.0,4,True,True,ortalamanın üstünde,56.0,56.0